# DetailNumberEmpty Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures..::..DetailNumberEmpty Property
BuiltInFailures..::..ViewFailures Class See Also
---
Detail Number is empty
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DetailNumberEmpty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DetailNumberEmpty As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DetailNumberEmpty {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewFailures Class
Autodesk.Revit.DB Namespace